<?
require_once('../vendor/autoload.php');
require_once('../src/helper.php');



$fn = '테스트파일';
$conf = [
    'sheet'=>[
        'columns'=>[
            ['width'=>10],
            ['width'=>20],
            ['width'=>30],
            ['width'=>40],
            ['width'=>'auto'],
            [],
            [],
            [],
            [],
            [],
            [],
        ],
    ],
    
    'header'=>[
        'columns'=>[
            ['style'=>[ 'font' => [ 'color'=>[ 'argb'=>PhpOffice\PhpSpreadsheet\Style\Color::COLOR_RED, ], ], ],],
        ]
    ],
    'footer'=>[
        'columns'=>[
            null,
            null,
            ['style'=>[ 'font' => [ 'color'=>[ 'argb'=>PhpOffice\PhpSpreadsheet\Style\Color::COLOR_BLUE, ], ], ],],
        ]
    ],
    'body'=>[
        'columns'=>[
            ['style'=>['numberFormat'=>['formatCode'=>PhpOffice\PhpSpreadsheet\Style\NumberFormat::FORMAT_TEXT,]]],
            ['style'=>['numberFormat'=>['formatCode'=>PhpOffice\PhpSpreadsheet\Style\NumberFormat::FORMAT_NUMBER,]]],
            ['style'=>[
                    'numberFormat'=>['formatCode'=>PhpOffice\PhpSpreadsheet\Style\NumberFormat::FORMAT_DATE_YYYYMMDD,],
                    'alignment' => [
                        'horizontal' => PhpOffice\PhpSpreadsheet\Style\Alignment::HORIZONTAL_CENTER,
                        'vertical' => PhpOffice\PhpSpreadsheet\Style\Alignment::VERTICAL_CENTER,
                    ],
                ]
            ],
            null,
            ['style'=>[
                    'alignment' => [ 'horizontal' => PhpOffice\PhpSpreadsheet\Style\Alignment::HORIZONTAL_RIGHT, ],
                ]
            ],
            null,
            null,
            null,
            null,
            null,
            null,
            null,
            null,
        ]
    ]
];
$header = [
    ['해더1','해더2','해더3','해더4','해더5','해더6','해더7','해더8','해더9','해더10','해더11','해더12','해더13',],
    ['해더:2-1','해더:2-2','해더:2-3','해더:2-4','해더:2-5','해더:2-6','해더:2-7','해더:2-8','해더:2-9','해더:2-10','해더:2-11','해더:2-12','해더:2-13',]
];
$footer = [
    ['풋터1','풋터2','풋터3','풋터4','풋터5','풋터6','풋터7','풋터8','풋터9','풋터10','풋터11','풋터12','풋터13',],
    ['풋터:2-1','풋터:2-2','풋터:2-3','풋터:2-4','풋터:2-5','풋터:2-6','풋터:2-7','풋터:2-8','풋터:2-9','풋터:2-10','풋터:2-11','풋터:2-12','풋터:2-13',]
];
$body = [
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    ['데이터1','22222222','2024-07-15','데이터4','오른쪽 정렬','데이터6','데이터7','데이터8','데이터9','데이터10','데이터11','데이터12','데이터13',],
    
];
downloadXlsx($fn,$conf,$body,$header,$footer);